init.el
;;; -*- lexical-binding: t; -*-

(setq debug-on-error t)
(setq debug-on-quit t)

(setq load-prefer-newer t)
(setq message-log-max t)

(require 'package)
(setq package-archives
      '(("gnu"          . "https://elpa.gnu.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")
        ("melpa"        . "https://melpa.org/packages/")
        ("org"          . "https://orgmode.org/elpa/")))

(unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
  (setq package-enable-at-startup nil)          ; To prevent initializing twice
  (package-initialize))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(setq use-package-always-ensure t)
(setq use-package-hook-name-suffix nil)
(setq use-package-enable-imenu-support t)
(setq use-package-compute-statistics t)

(eval-when-compile
  (require 'use-package))

(use-package quelpa-use-package
  :custom
  (quelpa-use-package-inhibit-loading-quelpa t "Improve startup performance"))

(use-package use-package-ensure-system-package)

(use-package general
  :config
  (general-create-definer my--leader-def
    :states '(normal visual insert emacs motion)
    :keymaps 'override
    :prefix "SPC"
    :non-normal-prefix "M-SPC")
  (general-create-definer my--local-leader-def
    :states '(normal visual insert emacs motion)
    :keymaps 'override
    :prefix "SPC m"
    :non-normal-prefix "M-SPC m")
  (my--leader-def
    "" '(nil :wk "leader")
    "o" '(:ignore t :wk "open")
    "O" '(:ignore t :wk "org")
    "p" '(:ignore t :wk "project")
    "P" '(:ignore t :wk "package")
    "b" '(:ignore t :wk "buffer")
    "f" '(:ignore t :wk "file")
    "e" '(:ignore t :wk "emacs")
    "g" '(:ignore t :wk "git")
    "/" '(:ignore t :wk "search")
    "j" '(:ignore t :wk "jump")
    "h" '(:ignore t :wk "help")
    "t" '(:ignore t :wk "toggle")
    "i" '(:ignore t :wk "insert")
    "q" '(:ignore t :wk "quit"))
  (my--local-leader-def
    "" '(nil :wk "local leader")))

(use-package evil
  :preface
  (defun my--save-and-kill-buffer ()
    (interactive)
    (save-buffer)
    (kill-this-buffer))
  :general
  (evil-insert-state-map
   "C-k" nil)
  :custom
  (evil-want-keybinding nil)
  (evil-split-window-below t)
  (evil-vsplit-window-right t)
  (evil-emacs-state-cursor 'hbar)
  (evil-mode-line-format nil)
  (evil-symbol-word-search t)
  (evil-move-beyond-eol nil)
  (evil-move-cursor-back t)
  :config
  (evil-mode t)
  (evil-ex-define-cmd "q" 'kill-this-buffer)
  (evil-ex-define-cmd "wq" 'my--save-and-kill-buffer))

(use-package evil-collection
  :after evil
  :custom
  (evil-collection-setup-minibuffer nil)
  (evil-collection-company-use-tng nil)
  :config
  (evil-collection-init))

(use-package evil-commentary
  :defer t
  :hook
  (after-init-hook . evil-commentary-mode))

(use-package evil-magit
  :after evil magit
  :custom
  (evil-magit-want-horizontal-movement t)
  (evil-magit-use-z-for-folds t))

(use-package evil-surround
  :defer t
  :hook
  (after-init-hook . global-evil-surround-mode))

(use-package evil-matchit
  :defer t
  :hook
  (after-init-hook . global-evil-matchit-mode))

(use-package evil-org
  :defer t
  :custom
  (evil-org-special-o/O '(item table-row))
  (evil-org-key-theme '(todo textobjects insert navigation heading))
  :hook
  (org-mode-hook . evil-org-mode))

(use-package evil-org-agenda
  :ensure evil-org
  :after evil org-agenda
  :config
  (evil-org-agenda-set-keys))

(use-package evil-mc
  :defer t
  :hook
  (after-init-hook . global-evil-mc-mode))

(use-package evil-traces
  :defer t
  :hook
  (after-init-hook . evil-traces-mode)
  :config
  (evil-traces-use-diff-faces))

(use-package which-key
  :defer t
  :custom
  (which-key-idle-delay 0.3)
  (which-key-sort-uppercase-first nil)
  :hook
  (after-init-hook . which-key-mode))

(use-package emacs
  :ensure nil
  :general
  (my--leader-def
    "qq" 'kill-emacs)
  :custom
  (inhibit-startup-screen t)
  (initial-scratch-message nil)
  (use-dialog-box nil)
  (enable-recursive-minibuffers t)
  (indent-tabs-mode nil "Don't use tabs")
  (create-lockfiles nil "Stop creating .# files")
  (frame-resize-pixelwise t)
  (window-resize-pixelwise t)
  (inhibit-compacting-font-caches t)
  (scroll-step 1)
  (scroll-preserve-screen-position t)
  (scroll-margin 0)
  (scroll-conservatively 101)
  (ring-bell-function 'ignore)
  (delete-by-moving-to-trash t)
  :hook
  (focus-out-hook . garbage-collect)
  :config
  (defalias 'yes-or-no-p 'y-or-n-p))

(use-package async
  :defer t
  :hook
  (after-init-hook . async-bytecomp-package-mode)
  (dired-mode-hook . dired-async-mode))

(use-package files
  :ensure nil
  :custom
  (require-final-newline t)
  (make-backup-files nil "Stop creating backup~ files")
  (auto-save-default nil "Stop creating #autosave# files")
  (enable-local-variables :all)
  (enable-local-eval t))

(use-package autorevert
  :ensure nil
  :defer t
  :custom
  (auto-revert-verbose nil)
  (global-auto-revert-non-file-buffers t)
  (auto-revert-check-vc-info t)
  :hook
  (after-init-hook . global-auto-revert-mode))

(use-package savehist
  :ensure nil
  :defer t
  :hook
  (after-init-hook . savehist-mode))

(use-package saveplace
  :ensure nil
  :defer t
  :hook
  (after-init-hook . save-place-mode))

(use-package recentf
  :ensure nil
  :defer t
  :custom
  (recentf-max-saved-items 300)
  :hook
  (after-init-hook . recentf-mode))

(use-package iqa
  :defer t
  :general
  (my--leader-def
    "ed" 'iqa-find-user-init-directory
    "ee" 'iqa-find-user-init-file
    "er" 'iqa-reload-user-init-file)
  :custom
  (iqa-user-init-file (concat user-emacs-directory "config.org")))

(use-package cus-edit
  :ensure nil
  :defer t
  :general
  (my--leader-def
    "oc" 'customize-group)
  :custom
  (custom-file null-device "Don't store customizations"))

(use-package epa
  :ensure nil
  :defer t
  :custom
  (epa-pinentry-mode 'loopback))

(use-package emacs
  :ensure nil
  :preface
