config.org
** Shell
Eshell
#+begin_src emacs-lisp
(use-package em-smart
  :ensure nil
  :after eshell
  :config
  (eshell-smart-initialize))

(use-package esh-autosuggest
  :hook
  (eshell-mode-hook . esh-autosuggest-mode))

(use-package eshell-fringe-status
  :hook
  (eshell-mode-hook . eshell-fringe-status-mode))

(use-package eshell-prompt-extras
  :after eshell
  :commands epe-theme-lambda
  :custom
  (eshell-highlight-prompt nil)
  (eshell-prompt-function 'epe-theme-lambda))
#+end_src

Quick access to shell
#+begin_src emacs-lisp
(use-package eshell-toggle
  :general
  ("s-t" 'eshell-toggle)
  :custom
  (eshell-toggle-use-projectile-root t)
  (eshell-toggle-run-command nil))
#+end_src

=$PATH= from user's shell
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :demand
  :config
  (exec-path-from-shell-initialize))
#+end_src

Use the Emacsclient as the =$EDITOR= of child processes
#+begin_src emacs-lisp
(use-package with-editor
  :general
  ([remap shell-command]       'with-editor-shell-command)
  ([remap async-shell-command] 'with-editor-async-shell-command)
  :hook
  (shell-mode-hook   . with-editor-export-editor)
  (term-exec-hook    . with-editor-export-editor)
  (eshell-mode-hook  . with-editor-export-editor))
#+end_src

** Ediff
#+begin_src emacs-lisp
(use-package ediff
  :ensure nil
  :custom
  (winner-dont-bind-my-keys t "Unbind C-right/C-left")
  (ediff-window-setup-function 'ediff-setup-windows-plain)
  (ediff-split-window-function 'split-window-horizontally)
  (ediff-merge-split-window-function 'split-window-horizontally)
  :hook
  (ediff-prepare-buffer-hook . show-all)
  (ediff-quit-hook . winner-undo))
#+end_src

** Completion
Ivy
#+begin_src emacs-lisp
(use-package ivy
  :general
  (ivy-mode-map
   "C-j" 'ivy-next-line
   "C-k" 'ivy-previous-line)
  (my--leader-def
    "bb" 'ivy-switch-buffer)
  :custom
  (ivy-wrap t)
  (ivy-fixed-height-minibuffer t)
  (ivy-use-virtual-buffers t)
  (ivy-virtual-abbreviate 'full)
  (ivy-on-del-error-function nil)
  (ivy-use-selectable-prompt t)
  (ivy-re-builders-alist '((counsel-rg . ivy--regex-plus)
                           (swiper     . ivy--regex-plus)
                           (t          . ivy--regex-fuzzy)))
  :hook
  (after-init-hook . ivy-mode))

(use-package ivy-hydra)

(use-package ivy-rich
  :custom
  (ivy-rich-path-style 'abbrev)
  :hook
  (ivy-mode-hook . ivy-rich-mode))
#+end_src

Counsel
#+begin_src emacs-lisp
(use-package counsel
  :general
  ([remap describe-face]            'counsel-describe-face)
  ([remap describe-function]        'counsel-describe-function)
  ([remap describe-variable]        'counsel-describe-variable)
  ([remap execute-extended-command] 'counsel-M-x)
  ([remap find-file]                'counsel-find-file)
  ([remap find-library]             'counsel-find-library)
  ([remap imenu]                    'counsel-imenu)
  (my--leader-def
    "." 'counsel-find-file

    "oL" 'counsel-find-library
    "oh" 'counsel-command-history

    "Pp" 'counsel-package

    "ff" 'counsel-find-file
    "fr" 'counsel-recentf

    "/b" 'swiper
    "/d" 'counsel-rg

    "tt" 'counsel-load-theme

    "hF" '(:ignore t :wk "face")
    "hFf" 'counsel-faces
    "hFe" 'counsel-colors-emacs
    "hFw" 'counsel-colors-web)
  :custom
  (counsel-describe-function-function 'helpful-callable)
  (counsel-describe-variable-function 'helpful-variable))

(use-package counsel-projectile
  :general
  (my--leader-def
    "/p" 'counsel-projectile-rg)
  :hook
  (after-init-hook . counsel-projectile-mode))
#+end_src

M-x interface
#+begin_src emacs-lisp
(use-package amx
  :custom
  (amx-backend 'ivy))
#+end_src

** OS-specific
MacOS tweaks
#+begin_src emacs-lisp
(use-package ns-win
  :if (memq window-system '(mac ns))
  :ensure nil
  :custom
  (mac-command-modifier 'super))

(use-package files
  :if (memq window-system '(mac ns))
  :ensure nil
  :custom
  (insert-directory-program "gls")
  (trash-directory "~/.Trash/emacs"))
#+end_src

[[https://adam.kruszewski.name/2017/09/emacs-in-wsl-and-opening-links/][WSL tweaks]]
#+begin_src emacs-lisp
(use-package browse-url
  :disabled
  :if (file-exists-p "/mnt/c/Windows/System32/cmd.exe")
  :ensure nil
  :custom
  (browse-url-generic-program "/mnt/c/Windows/System32/cmd.exe")
  (browse-url-generic-args '("/c" "start"))
  (browse-url-browser-function 'browse-url-generic))
#+end_src

** Help
#+begin_src emacs-lisp
(use-package help
  :ensure nil
  :general
  (my--leader-def
    "hd" 'describe-mode))

(use-package help-fns
  :ensure nil
  :general
  (my--leader-def
    "hf" 'describe-function
    "hv" 'describe-variable))

(use-package man
  :ensure nil
  :general
  (my--leader-def
    "hM" 'man))

(use-package helpful
  :general
  (my--leader-def
    "h." 'helpful-at-point
    "hC" 'helpful-command
    "hc" 'helpful-callable
    "hk" 'helpful-key
    "hm" 'helpful-macro))
#+end_src

** Restart
#+begin_src emacs-lisp
(use-package restart-emacs
  :general
  (my--leader-def
    "qr" 'restart-emacs))
#+end_src

** Tweaks for non-english keyboard layout
#+begin_src emacs-lisp
(use-package reverse-im
  :config
  (reverse-im-activate "russian-computer")
  (with-eval-after-load 'evil
    ;; cyrillic tweaks
    (define-key evil-normal-state-map (kbd "C-х") #'evil-force-normal-state)
    (define-key evil-insert-state-map (kbd "C-х") #'evil-normal-state)
    (define-key evil-visual-state-map (kbd "C-х") #'evil-exit-visual-state)))
#+end_src

* UI
** Common
#+begin_src emacs-lisp
(use-package frame
  :ensure nil
  :general
  (my--leader-def
    "tm" 'toggle-frame-maximized
    "tf" 'toggle-frame-fullscreen)
  :config
  (blink-cursor-mode -1))

(use-package tooltip
  :ensure nil
  :config
  (tooltip-mode -1))

(use-package menu-bar
  :ensure nil
  :config
  (menu-bar-mode -1))

(use-package fringe
  :ensure nil
  :init
  (setf (cdr (assq 'continuation fringe-indicator-alist))
        ;; '(nil nil) ;; no continuation indicators
        '(nil right-curly-arrow) ;; right indicator only
        ;; '(left-curly-arrow nil) ;; left indicator only
        ;; '(left-curly-arrow right-curly-arrow) ;; default
        ))

(use-package ansi-color
  :preface
  ;; http://endlessparentheses.com/ansi-colors-in-the-compilation-buffer-output.html
  (defun endless/colorize-compilation ()
    "Colorize from `compilation-filter-start' to `point'."
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region
       compilation-filter-start (point))))
  :hook
  (compilation-filter-hook . endless/colorize-compilation))
#+end_src

** Icons
#+begin_src emacs-lisp
(use-package font-lock+
  :ensure nil
  :quelpa
  (font-lock+ :repo "emacsmirror/font-lock-plus" :fetcher github))

(use-package all-the-icons
  :if (display-graphic-p)
  :config
  (unless (member "all-the-icons" (font-family-list))
    (all-the-icons-install-fonts t)))
#+end_src

** Mode Line
#+begin_src emacs-lisp
(use-package faces
  :ensure nil
  :custom-face
  (mode-line ((t :inherit mode-line :box nil :underline nil :overline nil)))
  (mode-line-inactive ((t :inherit mode-line-inactive :box nil :underline nil :overline nil))))

(use-package hide-mode-line
  :hook
  (dired-sidebar-mode-hook . hide-mode-line-mode))

(use-package minions
  :hook
  (after-init-hook . minions-mode))

(use-package doom-modeline
  :custom
  (doom-modeline-minor-modes t)
  (doom-modeline-buffer-file-name-style 'buffer-name)
  (doom-modeline-modal-icon nil)
  :hook
  (after-init-hook . doom-modeline-mode)
  :config
  (dolist (name '("*Messages*" "*Compile-Log*"))
    (when-let ((buffer (get-buffer name)))
      (with-current-buffer buffer
        (doom-modeline-set-main-modeline)))))
#+end_src

** Theme
#+begin_src emacs-lisp
(use-package heumi-theme
  :disabled
  :ensure nil
  :load-path "site-lisp/heumi-theme"
  :demand
  :config
  (load-theme 'heumi t))

(use-package solarized-theme
  ;; :disabled
  :demand
  :custom
  (solarized-distinct-doc-face t)
  (solarized-use-variable-pitch nil)
  (solarized-emphasize-indicators t)
  (solarized-scale-org-headlines nil)
  (solarized-scale-outline-headlines nil)
  (solarized-height-minus-1 1.0)
  (solarized-height-plus-1 1.0)
  (solarized-height-plus-2 1.0)
  (solarized-height-plus-3 1.0)
  (solarized-height-plus-4 1.0)
  :config
  (load-theme 'solarized-dark t))

(use-package doom-themes
  :disabled
  :custom
  (doom-themes-treemacs-theme "doom-colors")
  :config
  (load-theme 'doom-city-lights t)
  (doom-themes-treemacs-config)
  (doom-themes-org-config))
#+end_src

* Editor
