config.org
** Common
#+begin_src emacs-lisp
(use-package delsel
  :ensure nil
  :general
  ("C-c C-g" 'minibuffer-keyboard-quit)
  :hook
  (after-init-hook . delete-selection-mode))

(use-package simple
  :ensure nil
  :general
  (my--leader-def
    "SPC" 'execute-extended-command
    ":" 'eval-expression
    "tT" 'toggle-truncate-lines)
  :custom
  (backward-delete-char-untabify-method 'hungry)
  (async-shell-command-buffer 'new-buffer)
  :hook
  (after-init-hook . column-number-mode))

(use-package prog-mode
  :ensure nil
  :hook
  (after-init-hook . global-prettify-symbols-mode))

(use-package so-long
  :ensure nil
  :hook
  (after-init-hook . global-so-long-mode))

(use-package hungry-delete
  :hook
  (after-init-hook . global-hungry-delete-mode))
#+end_src

** Highlighting
#+begin_src emacs-lisp
(use-package hl-line
  :ensure nil
  :general
  (my--leader-def
    "tl" 'global-hl-line-mode)
  :hook
  (after-init-hook . global-hl-line-mode))

(use-package hl-todo
  :custom
  (hl-todo-highlight-punctuation ":")
  :hook
  (after-init-hook . global-hl-todo-mode))

(use-package highlight-indent-guides
  :general
  (my--leader-def
    "ti" 'highlight-indent-guides-mode))

(use-package highlight-numbers
  :hook
  (prog-mode-hook . highlight-numbers-mode))

(use-package highlight-blocks
  :general
  (my--leader-def
    "tb" 'highlight-blocks-mode))
#+end_src

Parentheses
#+begin_src emacs-lisp
(use-package paren
  :ensure nil
  :hook
  (after-init-hook . show-paren-mode))

(use-package elec-pair
  :ensure nil
  :hook
  (after-init-hook . electric-pair-mode))

(use-package rainbow-delimiters
  :hook
  (prog-mode-hook . rainbow-delimiters-mode)
  (cider-repl-mode-hook . rainbow-delimiters-mode))
#+end_src

Colorize color names
#+begin_src emacs-lisp
(use-package rainbow-mode
  :general
  (my--leader-def
    "tr" 'rainbow-mode)
  :hook
  (css-mode-hook . rainbow-mode))
#+end_src

Highlight special symbols
#+begin_src emacs-lisp
(use-package whitespace
  :ensure nil
  :general
  (my--leader-def
    "tw" 'whitespace-mode))

(use-package page-break-lines
  :hook
  (after-init-hook . global-page-break-lines-mode))

(use-package show-eol
  :general
  (my--leader-def
    "te" 'show-eol-mode))
#+end_src

Highlight symbols
#+begin_src emacs-lisp
(use-package hi-lock
  :ensure nil
  :general
  (my--leader-def
    "th" '(:ignore t :wh "highlight")
    "th." 'highlight-symbol-at-point
    "thp" 'highlight-phrase
    "thr" 'highlight-regexp
    "thl" 'highlight-lines-matching-regexp
    "thu" 'unhighlight-regexp))
#+end_src

Highlight identifiers
#+begin_src emacs-lisp
(use-package color-identifiers-mode
  :general
  (my--leader-def
    "tc" 'color-identifiers-mode))
#+end_src

** Line Numbers
#+begin_src emacs-lisp
(use-package display-line-numbers
  :ensure nil
  :general
  (my--leader-def
    "tn" 'display-line-numbers-mode)
  :custom
  (display-line-numbers-width-start t))
#+end_src

** Snippets
#+begin_src emacs-lisp
(use-package yasnippet
  :hook
  (text-mode-hook . yas-minor-mode-on)
  (prog-mode-hook . yas-minor-mode-on))

(use-package yasnippet-snippets)

(use-package ivy-yasnippet
  :general
  (my--leader-def
    "is" 'ivy-yasnippet))
#+end_src

** Auto Completion
#+begin_src emacs-lisp
(use-package company
  :general
  ("M-S-SPC" 'company-complete)
  :custom
  (company-minimum-prefix-length 2)
  (company-require-match 'never)
  (company-selection-wrap-around t)
  (company-tooltip-minimum-width 30)
  (company-tooltip-align-annotations t)
  (company-dabbrev-ignore-case nil)
  (company-dabbrev-downcase nil)
  :hook
  (after-init-hook . global-company-mode))

(use-package company-shell
  :after company
  :init
  (add-to-list 'company-backends 'company-shell))

(use-package company-statistics
  :after company
  :config
  (company-statistics-mode))
#+end_src

** Search
#+begin_src emacs-lisp
(use-package anzu
  :custom
  (anzu-cons-mode-line-p nil)
  :hook
  (after-init-hook . global-anzu-mode))

(use-package evil-anzu
  :after anzu)
#+end_src

** Folding
#+begin_src emacs-lisp
(use-package hideshow
  :ensure nil
  :hook
  (prog-mode-hook . hs-minor-mode))
#+end_src

** Spell Checking
#+begin_src emacs-lisp
(use-package ispell
  :if (executable-find "hunspell")
  :ensure nil
  :init
  ;; ignore $LANG for choosing dictionary
  ;; (setenv "DICTIONARY" "ru_RU,en_US")
  (setenv "LANG" "en_US.UTF-8")
  :custom
  (ispell-really-aspell nil)
  (ispell-really-hunspell t)
  (ispell-dictionary "ru_RU,en_US")
  :config
  (setq ispell-program-name "hunspell")
  ;; ispell-set-spellchecker-params has to be called
  ;; before ispell-hunspell-add-multi-dic will work
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "ru_RU,en_US"))

(use-package flyspell
  :general
  (my--leader-def
    "ts" 'flyspell-mode)
  (flyspell-mode-map
   "C-," nil
   "C-." nil
   "C-c $" nil)
  :custom
  (flyspell-delay 1)
  (flyspell-use-meta-tab nil)
  (flyspell-issue-message-flag nil)
  (flyspell-prog-text-faces '(;; font-lock-string-face
                              font-lock-comment-face
                              font-lock-doc-face))
  :hook
  (text-mode-hook . flyspell-mode)
  (org-mode-hook . flyspell-mode)
  (prog-mode-hook . flyspell-prog-mode))

(use-package flyspell-correct
  :general
  (flyspell-mode-map
   "C-;" 'flyspell-correct-at-point))

(use-package flyspell-correct-ivy
  :after flyspell-correct
  :custom
  (flyspell-correct-interface 'flyspell-correct-ivy))
#+end_src

** Syntax Checking
#+begin_src emacs-lisp
(use-package flycheck
  :custom-face
  (fringe ((t :background nil)))
  :custom
  (flycheck-indication-mode 'right-fringe)
  :hook
  (prog-mode-hook . flycheck-mode))

(use-package fringe-helper
  :demand
  :after flycheck
  :config
  (fringe-helper-define 'flycheck-fringe-bitmap-double-arrow 'center
    ".....X.."
    "....XX.."
    "...XXX.."
    "..XXXX.."
    "...XXX.."
    "....XX.."
    ".....X.."))

(use-package flycheck-inline
  :custom-face
  (flycheck-inline-error ((t :inherit compilation-error :box t :height 0.9)))
  (flycheck-inline-info ((t :inherit compilation-info :box t :height 0.9)))
  (flycheck-inline-warning ((t :inherit compilation-warning :box t :height 0.9)))
  :hook
  (flycheck-mode-hook . flycheck-inline-mode))
#+end_src

** Indexing
#+begin_src emacs-lisp
(use-package imenu
  :ensure nil
  :defer 1
  :general
  (my--leader-def
    "ji" 'imenu))
#+end_src

** Jumps
Avy
#+begin_src emacs-lisp
(use-package avy
  :general
  (my--leader-def
    "jc" 'avy-goto-char
    "jw" 'avy-goto-word-0
    "jW" 'avy-goto-word-1
    "jl" 'avy-goto-line
    "jL" 'avy-goto-end-of-line)
  :custom
  (avy-background t))

(use-package ace-window
  :general
  (evil-window-map
   "." 'ace-window)
  :custom
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (aw-scope 'frame))

(use-package link-hint
  :general
  (my--leader-def
    "ol" 'link-hint-open-link))
#+end_src

Jump to definition
#+begin_src emacs-lisp
(use-package dumb-jump
  :preface
  (defhydra hydra-dumb-jump
    (:color blue :columns 3)
    ("j" dumb-jump-go "go")
    ("o" dumb-jump-go-other-window "other window")
    ("e" dumb-jump-go-prefer-external "go external")
    ("x" dumb-jump-go-prefer-external-other-window "go external other window")
    ("i" dumb-jump-go-prompt "prompt")
    ("l" dumb-jump-quick-look "quick look")
    ("b" dumb-jump-back "back"))
  :general
  (my--leader-def
    "jj" '(hydra-dumb-jump/body :wk "hydra-dumb-jump"))
  :custom
  (dumb-jump-selector 'ivy)
  (dumb-jump-prefer-searcher 'rg))
#+end_src

** Projects
#+begin_src emacs-lisp
(use-package projectile
  :general
  (my--leader-def
    "p" '(:keymap projectile-command-map :package projectile :wk "project"))
  :custom
  (projectile-enable-caching t)
  (projectile-completion-system 'ivy)
  :hook
  (after-init-hook . projectile-mode))
#+end_src

