init.el

(use-package delsel
  :ensure nil
  :defer t
  :general
  ("C-c C-g" 'minibuffer-keyboard-quit)
  :hook
  (after-init-hook . delete-selection-mode))

(use-package simple
  :ensure nil
  :defer t
  :general
  (my--leader-def
    "SPC" 'execute-extended-command
    ":" 'eval-expression
    "tT" 'toggle-truncate-lines)
  :custom
  (backward-delete-char-untabify-method 'hungry)
  (async-shell-command-buffer 'new-buffer)
  :hook
  (after-init-hook . column-number-mode))

(use-package prog-mode
  :ensure nil
  :defer t
  :hook
  (after-init-hook . global-prettify-symbols-mode))

(use-package subword
  :ensure nil
  :defer t
  :hook
  (prog-mode-hook . subword-mode))

(use-package hungry-delete
  :defer t
  :hook
  (after-init-hook . global-hungry-delete-mode))

(use-package hl-line
  :ensure nil
  :defer t
  :general
  (my--leader-def
    "tl" 'global-hl-line-mode)
  :hook
  (after-init-hook . global-hl-line-mode))

(use-package hl-todo
  :defer t
  :custom
  (hl-todo-highlight-punctuation ":")
  :hook
  (after-init-hook . global-hl-todo-mode))

(use-package highlight-indent-guides
  :defer t
  :general
  (my--leader-def
    "ti" 'highlight-indent-guides-mode))

(use-package highlight-numbers
  :defer t
  :hook
  (prog-mode-hook . highlight-numbers-mode))

(use-package highlight-blocks
  :defer t
  :general
  (my--leader-def
    "tb" 'highlight-blocks-mode))

(use-package paren
  :ensure nil
  :defer t
  :hook
  (after-init-hook . show-paren-mode))

(use-package elec-pair
  :ensure nil
  :defer t
  :hook
  (after-init-hook . electric-pair-mode))

(use-package rainbow-delimiters
  :defer t
  :hook
  (prog-mode-hook . rainbow-delimiters-mode)
  (cider-repl-mode-hook . rainbow-delimiters-mode))

(use-package rainbow-mode
  :defer t
  :general
  (my--leader-def
    "tr" 'rainbow-mode)
  :hook css-mode-hook)

(use-package whitespace
  :ensure nil
  :defer t
  :general
  (my--leader-def
    "tw" 'whitespace-mode))

(use-package page-break-lines
  :defer t
  :hook
  (after-init-hook . global-page-break-lines-mode))

(use-package show-eol
  :defer t
  :general
  (my--leader-def
    "te" 'show-eol-mode))

(use-package hi-lock
  :ensure nil
  :defer t
  :general
  (my--leader-def
    "th" '(:ignore t :wh "highlight")
    "th." 'highlight-symbol-at-point
    "thp" 'highlight-phrase
    "thr" 'highlight-regexp
    "thl" 'highlight-lines-matching-regexp
    "thu" 'unhighlight-regexp))

(use-package so-long
  :ensure nil
  :defer t
  :hook
  (after-init-hook . global-so-long-mode))

(use-package display-line-numbers
  :ensure nil
  :defer t
  :general
  (my--leader-def
    "tn" 'display-line-numbers-mode)
  :custom
  (display-line-numbers-width-start t))

(use-package yasnippet
  :defer t
  :hook
  (text-mode-hook . yas-minor-mode-on)
  (prog-mode-hook . yas-minor-mode-on))

(use-package yasnippet-snippets
  :defer t)

(use-package ivy-yasnippet
  :defer t
  :general
  (my--leader-def
    "is" 'ivy-yasnippet))

(use-package company
  :defer t
  :general
  ("M-S-SPC" 'company-complete)
  :custom
  (company-minimum-prefix-length 2)
  (company-require-match 'never)
  (company-selection-wrap-around t)
  (company-tooltip-minimum-width 30)
  (company-tooltip-align-annotations t)
  (company-dabbrev-ignore-case nil)
  (company-dabbrev-downcase nil)
  :hook
  (after-init-hook . global-company-mode))

(use-package company-shell
  :defer t
  :after company
  :init
  (add-to-list 'company-backends 'company-shell))

(use-package company-statistics
  :defer t
  :after company
  :config
  (company-statistics-mode))

(use-package anzu
  :defer t
  :custom
  (anzu-cons-mode-line-p nil)
  :hook
  (after-init-hook . global-anzu-mode))

(use-package evil-anzu
  :defer t
  :after evil anzu)

(use-package hideshow
  :ensure nil
  :defer t
  :hook
  (prog-mode-hook . hs-minor-mode))

(use-package ispell
  :if (executable-find "hunspell")
  :ensure nil
  :defer t
  :init
  ;; ignore $LANG for choosing dictionary
  ;; (setenv "DICTIONARY" "ru_RU,en_US")
  (setenv "LANG" "en_US.UTF-8")
  :custom
  (ispell-really-aspell nil)
  (ispell-really-hunspell t)
  (ispell-dictionary "ru_RU,en_US")
  :config
  (setq ispell-program-name "hunspell")
  ;; ispell-set-spellchecker-params has to be called
  ;; before ispell-hunspell-add-multi-dic will work
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "ru_RU,en_US"))

(use-package flyspell
  :defer t
  :general
  (my--leader-def
    "ts" 'flyspell-mode)
  (flyspell-mode-map
   "C-," nil
   "C-." nil
   "C-c $" nil)
  :custom
  (flyspell-delay 1)
  (flyspell-use-meta-tab nil)
  (flyspell-issue-message-flag nil)
  (flyspell-prog-text-faces '(;; font-lock-string-face
                              font-lock-comment-face
                              font-lock-doc-face))
  :hook
  (text-mode-hook . flyspell-mode)
  (org-mode-hook . flyspell-mode)
  (prog-mode-hook . flyspell-prog-mode))

(use-package flyspell-correct
  :defer t
  :general
  (flyspell-mode-map
   "C-;" 'flyspell-correct-at-point))

(use-package flyspell-correct-ivy
  :defer t
  :after flyspell-correct
  :custom
  (flyspell-correct-interface 'flyspell-correct-ivy))

(use-package flycheck
  :defer t
  :custom
  (flycheck-indication-mode 'right-fringe)
  :hook
  (prog-mode-hook . flycheck-mode))

(use-package fringe-helper
  :after flycheck
  :config
  (fringe-helper-define 'flycheck-fringe-bitmap-double-arrow 'center
    ".....X.."
    "....XX.."
    "...XXX.."
    "..XXXX.."
    "...XXX.."
    "....XX.."
    ".....X.."))

(use-package flycheck-inline
  :defer t
  :custom-face
  (flycheck-inline-error ((t :inherit compilation-error :box t :height 0.9)))
  (flycheck-inline-info ((t :inherit compilation-info :box t :height 0.9)))
  (flycheck-inline-warning ((t :inherit compilation-warning :box t :height 0.9)))
  :hook
  (flycheck-mode-hook . flycheck-inline-mode))

(use-package imenu
  :ensure nil
  :defer 1
  :general
  (my--leader-def
    "ji" 'imenu))

(use-package avy
  :defer t
  :general
  (my--leader-def
    "jc" 'avy-goto-char
    "jw" 'avy-goto-word-0
    "jW" 'avy-goto-word-1
    "jl" 'avy-goto-line
    "jL" 'avy-goto-end-of-line)
  :custom
  (avy-background t))

(use-package ace-window
  :defer t
  :general
  (evil-window-map
   "." 'ace-window)
  :custom
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (aw-scope 'frame))

(use-package link-hint
  :defer t
  :general
  (my--leader-def
    "ol" 'link-hint-open-link))

(use-package dumb-jump
  :defer t
  :preface
  (defhydra hydra-dumb-jump
    (:color blue :columns 3)
    ("j" dumb-jump-go "go")
    ("o" dumb-jump-go-other-window "other window")
    ("e" dumb-jump-go-prefer-external "go external")
    ("x" dumb-jump-go-prefer-external-other-window "go external other window")
    ("i" dumb-jump-go-prompt "prompt")
    ("l" dumb-jump-quick-look "quick look")
    ("b" dumb-jump-back "back"))
  :general
  (my--leader-def
    "jj" '(hydra-dumb-jump/body :wk "hydra-dumb-jump"))
  :custom
  (dumb-jump-selector 'ivy)
  (dumb-jump-prefer-searcher 'rg))

(use-package projectile
  :defer t
  :general
  (my--leader-def
    "p" '(:keymap projectile-command-map :package projectile :wk "project"))
  :custom
  (projectile-enable-caching t)
  (projectile-completion-system 'ivy)
  :hook
  (after-init-hook . projectile-mode))
