init.el

(use-package lsp-mode
  :defer t
  :general
  (my--local-leader-def :keymaps 'lsp-mode-map
    "f" '(:ignore t :wk "find")
    "fd" '(lsp-find-definition :wk "definition")
    "fi" '(lsp-find-implementation :wk "implementation")
    "fr" '(lsp-find-references :wk "references")
    "ft" '(lsp-find-type-definition :wk "type definition")

    "g" '(:ignore t :wk "goto")
    "gd" '(lsp-goto-type-definition :wk "definition")
    "gi" '(lsp-goto-implementation :wk "implementation")

    "w" '(:ignore t :wk "workspace")
    "wa" '(lsp-workspace-folders-add :wk "add")
    "wr" '(lsp-workspace-folders-remove :wk "remove")
    "ws" '(lsp-workspace-folders-switch :wk "switch")
    "wR" '(lsp-workspace-restart :wk "restart")
    "wQ" '(lsp-workspace-shutdown :wk "shutdown")

    "R" '(:ignore t :wk "refactor")
    "Rr" '(lsp-rename :wk "rename")

    "=" '(lsp-format-buffer :wk "format")
    "d" '(lsp-describe-thing-at-point :wk "doc")
    "S" '(lsp-describe-session :wk "session"))
  :custom
  (lsp-prefer-flymake nil))

(use-package lsp-ui
  :defer t
  :after lsp-mode
  :custom
  (lsp-ui-doc-enable nil)
  (lsp-ui-sideline-enable nil))

(use-package lsp-treemacs
  :defer t
  :after lsp-mode treemacs
  :general
  (my--local-leader-def :keymaps 'lsp-mode-map
    "T" '(:ignore :wk "treemacs")
    "Te" '(lsp-treemacs-errors-list :wk "error list")))

(use-package company-lsp
  :defer t
  :after company lsp-mode
  :custom
  (company-lsp-cache-candidates 'auto)
  :init
  (add-to-list 'company-backends 'company-lsp))

(use-package dap-mode
  :defer t
  :after lsp-mode
  :general
  (my--local-leader-def :keymaps 'dap-mode-map
    "D" '(dap-hydra :wk "debug"))
  :config
  (dap-mode 1)
  (dap-ui-mode 1))

(use-package editorconfig
  :defer t
  :hook
  (prog-mode-hook . editorconfig-mode)
  (text-mode-hook . editorconfig-mode))

(use-package treemacs
  :defer t
  :preface
  (defun my--hide-fringes ()
    (when (display-graphic-p)
      (set-window-fringes nil 0 0)))
  :general
  (my--leader-def
    "0" 'treemacs-select-window
    "ft" 'treemacs)
  :custom-face
  (treemacs-root-face ((t :inherit font-lock-constant-face :bold t :height 1.1)))
  :custom
  (treemacs-collapse-dirs (if (executable-find "python") 3 0))
  (treemacs-follow-after-init t)
  (treemacs-show-cursor t)
  (treemacs-no-png-images nil)
  (treemacs-no-delete-other-windows nil)
  (treemacs-space-between-root-nodes nil)
  (treemacs-width 35)
  (treemacs-recenter-after-file-follow 'on-distance)
  (treemacs-recenter-after-tag-follow 'on-distance)
  :hook
  (treemacs-mode-hook . hide-mode-line-mode)
  (treemacs-mode-hook . my--hide-fringes)
  :config
  (treemacs-create-theme "Icons"
    :config
    (progn
      (treemacs-create-icon
       :icon (concat (all-the-icons-octicon "repo" :v-adjust -0.1 :height 1.2) " ")
       :extensions (root))

      (treemacs-create-icon
       :icon (concat  (all-the-icons-octicon "file-directory" :v-adjust 0) " ")
       :extensions (dir-open))
      (treemacs-create-icon
       :icon (concat (all-the-icons-octicon "file-directory" :v-adjust 0) " ")
       :extensions (dir-closed))

      (treemacs-create-icon
       :icon (concat "  " (all-the-icons-octicon "tag" :v-adjust 0) " ")
       :extensions (tag-leaf))
      (treemacs-create-icon
       :icon (concat
              (all-the-icons-octicon "chevron-down" :v-adjust 0)
              " "
              (all-the-icons-octicon "tag" :v-adjust 0)
              " ")
       :extensions (tag-open))
      (treemacs-create-icon
       :icon (concat
              (all-the-icons-octicon "chevron-right" :v-adjust 0)
              " "
              (all-the-icons-octicon "tag" :v-adjust 0)
              " ")
       :extensions (tag-closed))

      (treemacs-create-icon
       :icon (concat (all-the-icons-octicon "file-code" :v-adjust 0) " ")
       :extensions (fallback))))

  (treemacs-load-theme "Icons"))

(use-package treemacs-evil
  :defer t
  :after treemacs evil)

(use-package treemacs-projectile
  :defer t
  :after treemacs projectile)

(use-package treemacs-icons-dired
  :defer t
  :hook
  (dired-mode-hook . treemacs-icons-dired-mode))

(use-package treemacs-magit
  :defer t
  :after treemacs magit)

(use-package highlight-defined
  :defer t
  :custom
  (highlight-defined-face-use-itself t)
  :hook
  (emacs-lisp-mode-hook . highlight-defined-mode))

(use-package highlight-quoted
  :defer t
  :hook
  (emacs-lisp-mode-hook . highlight-quoted-mode))

(use-package erefactor
  :defer t
  :general
  (my--local-leader-def :keymaps 'emacs-lisp-mode-map
    "R" '(:keymap erefactor-map :wk "refactor")))

(use-package eros
  :defer t
  :custom-face
  (eros-result-overlay-face ((t :background "grey90")))
  :hook
  (emacs-lisp-mode-hook . eros-mode))

(use-package clojure-mode
  :defer t)

(use-package clojure-mode-extra-font-locking
  :defer t)

(use-package clojure-snippets
  :defer t)

(use-package cider
  :defer t
  :general
  (my--local-leader-def :keymaps 'clojure-mode-map
    "c" '(:ignore t :wk "connect")
    "cc" '(cider-jack-in :wk "jack-in")
    "cj" '(cider-jack-in-clj :wk "jack-in-clj")
    "cs" '(cider-jack-in-cljs :wk "jack-in-cljs")
    "cC" '(cider-connect :wk "connect")
    "cR" '(cider-restart :wk "restart")
    "cQ" '(cider-quit :wk "quit")

    "b" '(:ignore t :wk "buffer")
    "bs" 'cider-scratch

    "=" '(cider-format-buffer :wk "format"))
  :custom-face
  (cider-result-overlay-face ((t :background "grey90")))
  :custom
  (cider-repl-use-pretty-printing t)
  (cider-repl-pop-to-buffer-on-connect 'display-only)
  (cider-repl-history-display-style 'one-line)
  (cider-repl-history-highlight-current-entry t)
  (cider-repl-history-highlight-inserted-item t)
  :hook
  (cider-repl-mode-hook . subword-mode)
  (cider-mode-hook . cider-company-enable-fuzzy-completion)
  (cider-repl-mode-hook . cider-company-enable-fuzzy-completion))

(use-package cider-hydra
  :defer t
  :general
  (my--local-leader-def :keymaps 'clojure-mode-map
    "d" '(cider-hydra-doc/body :wk "doc")
    "e" '(cider-hydra-eval/body :wk "eval")
    "t" '(cider-hydra-test/body :wk "test")
    "r" '(cider-hydra-repl/body :wk "repl"))
  :hook
  (clojure-mode-hook . cider-hydra-mode))

(use-package clj-refactor
  :pin melpa-stable
  :defer t
  :general
  (my--local-leader-def :keymaps 'clojure-mode-map
    "R" '(hydra-cljr-help-menu/body :wk "refactor"))
  :hook
  (clojure-mode-hook . clj-refactor-mode))

(use-package eldoc
  :ensure nil
  :defer t
  :hook
  (clojure-mode-hook . eldoc-mode)
  (cider-repl-mode-hook . eldoc-mode))
