config.org
** Java
#+begin_src emacs-lisp
(use-package lsp-java
  :after cc-mode
  :general
  (my--local-leader-def :keymaps 'java-mode-map
    "Re" '(:ignore t :wk "extract")
    "Rem" '(lsp-java-extract-method :wk "method")
    "Rec" '(lsp-java-extract-to-constant :wk "constant")
    "Rel" '(lsp-java-extract-to-local-variable :wk "local variable")

    "Ra" '(:ignore t :wk "add")
    "Rai" '(lsp-java-add-import :wk "missing import")
    "Rau" '(lsp-java-add-unimplemented-methods :wk "unimplemented methods")
    "Rat" '(lsp-java-add-throws :wk "throws")

    "Rc" '(:ignore t :wk "create")
    "Rcp" '(lsp-java-create-parameter :wk "parameter")
    "Rcf" '(lsp-java-create-field :wk "field")
    "Rcl" '(lsp-java-create-local :wk "local")

    "Ro" '(lsp-java-organize-imports :wk "organize imports")

    "G" '(:ignore t :wk "generate")
    "Gt" '(lsp-java-generate-to-string :wk "toString")
    "Ge" '(lsp-java-generate-equals-and-hash-code :wk "equals and hashCode")
    "Go" '(lsp-java-generate-overrides :wk "method overrides")
    "Gg" '(lsp-java-generate-getters-and-setters :wk "getters and setters")

    "P" '(:ignore t :wk "project")
    "Pb" '(lsp-java-build-project :wk "build")
    "Pc" '(lsp-java-update-project-configuration :wk "update configuration")
    "Pu" '(lsp-java-update-project-uris :wk "update URIs")

    "T" '(:ignore t :wk "treemacs")
    "Tr" '(lsp-java-treemacs-register :wk "register")
    "Tu" '(lsp-java-treemacs-unregister :wk "unregister"))
  :config
  (add-hook 'java-mode-hook 'lsp))

(use-package lsp-java-boot
  :ensure lsp-java
  :hook
  (lsp-mode-hook . lsp-lens-mode)
  (java-mode-hook . lsp-java-boot-lens-mode))

(use-package dap-java
  :ensure nil
  :after lsp-java)
#+end_src

** Go
#+begin_src emacs-lisp
(use-package go-mode
  :ensure-system-package
  (gopls . "go get -u golang.org/x/tools/cmd/gopls")
  :hook
  (go-mode-hook . lsp))

(use-package go-tag
  :after go-mode
  :general
  (my--local-leader-def :keymaps 'go-mode-map
    "Rt" '(:ignore t :wk "tag")
    "Rta" '(go-tag-add :wk "add")
    "Rtr" '(go-tag-remove :wk "remove"))
  :custom
  (go-tag-args '("-transform" "snakecase")))

(use-package gotest
  :after go-mode
  :general
  (my--local-leader-def :keymaps 'go-mode-map
    "e" '(:ignore t :wk "eval")
    "ee" '(go-run :wk "run")

    "t" '(:ignore t :wk "test")
    "tf" '(go-test-current-file :wk "file")
    "tt" '(go-test-current-test :wk "test")
    "tp" '(go-test-current-project :wk "project")

    "b" '(:ignore t :wk "benchmark")
    "bb" '(go-test-current-benchmark :wk "benchmark")
    "bf" '(go-test-current-file-benchmarks :wk "file")
    "bp" '(go-test-current-project-benchmarks :wk "project")))

(use-package go-playground
  :after go-mode)

(use-package gorepl-mode
  :ensure-system-package
  (gore . "go get -u github.com/motemen/gore/cmd/gore")
  :general
  (my--local-leader-def :keymaps 'go-mode-map
    "r" 'gorepl-hydra/body)
  :hook
  (go-mode-hook . gorepl-mode))
#+end_src

** Protobuf
#+begin_src emacs-lisp
(use-package protobuf-mode)
#+end_src

** Makefile
#+begin_src emacs-lisp
(use-package makefile-executor
  :general
  (my--local-leader-def :keymaps 'makefile-mode-map
    "e" '(:ignore t :wk "eval")
    "ee" '(makefile-executor-execute-target :wk "execute")
    "eb" '(makefile-executor-execute-target :wk "execute in dedicated buffer")
    "el" '(makefile-executor-execute-target :wk "execute last"))
  :hook
  (makefile-mode-hook . makefile-executor-mode))
#+end_src

** JS
#+begin_src emacs-lisp
(use-package js2-mode
  :ensure-system-package
  ((typescript-language-server . "npm i -g typescript-language-server")
   (typescript                 . "npm i -g typescript"))
  :mode "\\.m?js\\'"
  :hook
  (js2-mode-hook . lsp))

(use-package rjsx-mode
  :mode "components/.+\\.js$"
  :hook
  (rjsx-mode-hook . lsp))

(use-package js2-refactor
  :general
  (my--local-leader-def :keymaps '(js2-mode-map rjsx-mode-map)
    "R." '(:keymap js2-refactor-mode-map :wk "js2-refactor"))
  :hook
  (js2-mode-hook  . js2-refactor-mode)
  (rjsx-mode-hook . js2-refactor-mode)
  :config
  (js2r-add-keybindings-with-prefix ""))

(use-package npm-mode
  :hook
  (js2-mode-hook  . npm-mode)
  (rjsx-mode-hook . npm-mode))
#+end_src

** PlantUML
#+begin_src emacs-lisp
(use-package plantuml-mode
  :general
  (my--local-leader-def :keymaps 'plantuml-mode-map
    "p" '(plantuml-preview :wk "preview"))
  :custom
  (plantuml-output-type (if (display-images-p) "png" "txt"))
  (plantuml-default-exec-mode 'jar)
  (plantuml-jar-path
   (car (last (file-expand-wildcards
               "/usr/local/Cellar/plantuml/*/libexec/plantuml.jar")))))

(use-package flycheck-plantuml
  :hook
  (plantuml-mode-hook . flycheck-plantuml-setup))

(use-package ob-plantuml
  :ensure org-plus-contrib
  :after org
  :custom
  (org-plantuml-jar-path plantuml-jar-path))
#+end_src

** SQL
#+begin_src emacs-lisp
(use-package sql
  :ensure nil
  :general
  (my--local-leader-def :keymaps 'sql-mode-map
    "c" '(:ignore t :wk "connect")
    "cc" '(sql-connect :wk "connect")

    "e" '(:ignore t :wk "eval")
    "ee" '(sql-send-paragraph :wk "paragraph")
    "el" '(sql-send-line-and-next :wk "line and next")
    "eb" '(sql-send-buffer :wk "buffer")
    "er" '(sql-send-region :wk "region")
    "es" '(sql-send-string :wk "string")

    "l" '(:ignore t :wk "list")
    "la" '(sql-list-all :wk "all")
    "lt" '(sql-list-table :wk "table"))
  :custom
  (sql-connection-alist '((pg-local
                           (sql-product 'postgres)
                           (sql-port 5432)
                           (sql-server "localhost")
                           (sql-user "postgres")
                           (sql-password "postgres")
                           (sql-database "postgres")))))
#+end_src

** Vimrc
#+begin_src emacs-lisp
(use-package vimrc-mode)
#+end_src

** Groovy
#+begin_src emacs-lisp
(use-package groovy-mode)
#+end_src

** Markdown
#+begin_src emacs-lisp
(use-package markdown-mode
  :general
  (my--local-leader-def :keymaps 'markdown-mode-map
    "p" 'markdown-preview)
  :custom
  (markdown-command "pandoc")
  (markdown-fontify-code-blocks-natively t)
  :config
  (add-to-list 'markdown-code-lang-modes '("clj" . clojure-mode)))

(use-package grip-mode
  :general
  (my--local-leader-def :keymaps 'markdown-mode-map
    "g" 'grip-mode))
#+end_src

** JSON
#+begin_src emacs-lisp
(use-package json-mode
  :hook
  (json-mode-hook . (lambda () (setq flycheck-checker 'json-jq))))
#+end_src

** YAML
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "Procfile\\'"
  :hook
  (yaml-mode-hook . flycheck-mode))

(use-package flycheck-yamllint
  :hook
  (yaml-mode-hook . flycheck-yamllint-setup))
#+end_src

