config.org
* Git
Magit
#+begin_src emacs-lisp
(use-package magit
  :commands magit-blame
  :preface
  (defun my--magit-status ()
    (interactive)
    (let ((current-prefix-arg '(4)))
      (call-interactively #'magit-status)))
  :general
  (my--leader-def
    "g." 'magit-dispatch
    "gI" 'magit-init
    "gb" 'magit-blame
    "gc" 'magit-clone
    "gg" 'magit-status
    "gl" 'my--magit-status
    "gL" 'magit-log-buffer-file)
  :custom
  (magit-completing-read-function 'ivy-completing-read)
  (magit-clone-default-directory "~/Projects")
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  (magit-repository-directories `((,user-emacs-directory . 0)
                                  (,magit-clone-default-directory . 1))))

(use-package magit-todos
  :custom
  (magit-todos-keyword-suffix (rx (optional "(" (1+ (not (any ")"))) ")" ":")))
  :hook
  (magit-mode-hook . magit-todos-mode))
#+end_src

Git stuff
#+begin_src emacs-lisp
(use-package git-timemachine
  :general
  (my--leader-def
    "gt" 'git-timemachine))

(use-package gitignore-templates
  :general
  (my--leader-def
    "gi" 'gitignore-templates-new-file)
  (my--local-leader-def :keymaps 'gitignore-mode-map
    "i" 'gitignore-templates-insert))

(use-package gitattributes-mode)
(use-package gitconfig-mode)
(use-package gitignore-mode)
#+end_src

Highlight diff
#+begin_src emacs-lisp
(use-package diff-hl
  :custom
  (diff-hl-draw-borders nil)
  :hook
  (after-init-hook . global-diff-hl-mode)
  (diff-hl-mode-hook . diff-hl-flydiff-mode)
  (dired-mode-hook . diff-hl-dired-mode)
  (magit-post-refresh-hook . diff-hl-magit-post-refresh))
#+end_src

* Org
** Common
#+begin_src emacs-lisp
(use-package org
  :ensure org-plus-contrib
  :preface
  (defun my--open-org-directory () (interactive) (find-file org-directory))
  (defun my--open-org-inbox-file () (interactive) (find-file my--org-inbox-file))
  (defun my--open-org-todo-file () (interactive) (find-file my--org-todo-file))
  (defun my--open-org-notes-file () (interactive) (find-file my--org-notes-file))
  :general
  (my--leader-def
    "Oa" '(org-agenda :wk "agenda")
    "O." '(my--open-org-directory :wk "open org-directory")
    "Oi" '(my--open-org-inbox-file :wk "open inbox")
    "Ot" '(my--open-org-todo-file :wk "open todo")
    "On" '(my--open-org-notes-file :wk "open notes"))
  :custom-face
  (org-tag ((t :inherit shadow)))
  (org-ellipsis ((t :underline nil)))
  :custom
  (org-insert-heading-respect-content t "Insert new headings after current subtree rather than inside it")

  (org-startup-indented t)
  (org-tags-column 0)
  ;; (org-ellipsis "  ")
  (org-ellipsis "…")
  (org-pretty-entities t)
  (org-use-sub-superscripts '{} "Require {} for sub/super scripts")
  (org-return-follows-link t)

  (org-list-allow-alphabetical t)
  (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+")))

  (org-startup-with-inline-images t)

  (org-src-fontify-natively t)
  (org-src-tab-acts-natively t)
  (org-src-window-setup 'current-window)
  (org-edit-src-content-indentation 0)
  (org-catch-invisible-edits 'smart)

  (org-hide-leading-stars t)
  (org-hide-leading-stars-before-indent-mode t)

  (org-fontify-done-headline nil)
  (org-fontify-quote-and-verse-blocks t)
  (org-fontify-whole-heading-line t)

  (org-todo-keywords '((sequence "TODO(t)" "WAIT(w@/!)" "|" "DONE(d!/@)" "CANCELED(c@/!)")))
  (org-priority-faces '((?A . (:inherit error :weight bold))
                        (?B . (:inherit warning :weight bold))
                        (?C . (:inherit success :weight bold))))
  (org-log-into-drawer t)

  (org-directory "~/Org")
  (my--org-inbox-file (concat org-directory "/inbox.org"))
  (my--org-todo-file (concat org-directory "/todo.org"))
  (my--org-notes-file (concat org-directory "/notes.org"))
  (org-agenda-files `(,my--org-inbox-file ,my--org-todo-file))
  (org-archive-location (concat org-directory "/old/archive.org" "::* From %s")))
#+end_src

** Org Bullets
#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :custom
  (org-bullets-bullet-list '("•"))
  (org-bullets--keywords
   `(("^\\*+ "
      (0 (let* ((level (- (match-end 0) (match-beginning 0) 1)))
           (compose-region (- (match-end 0) 2)
                           (- (match-end 0) 1)
                           (org-bullets-level-char level))
           (dolist (n (number-sequence
                       (match-beginning 0)
                       (- (match-end 0) 3)))
             (compose-region n (+ n 1) " "))
           (put-text-property (match-beginning 0)
                              (- (match-end 0) 2)
                              'face (list :inherit 'org-hide))
           nil)))))
  :hook
  (org-mode-hook . org-bullets-mode))
#+end_src

** Table of Contents
#+begin_src emacs-lisp
(use-package toc-org
  :hook
  (org-mode-hook . toc-org-enable))
#+end_src

** Babel
#+begin_src emacs-lisp
(use-package ob-core
  :ensure org-plus-contrib
  :hook
  (org-babel-after-execute-hook . org-redisplay-inline-images)
  :config
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (restclient . t)
     (plantuml . t))))

(use-package ob-async
  :after org)
#+end_src

* Tools
** Docker
#+begin_src emacs-lisp
(use-package docker
  :general
  (my--leader-def
    "od" 'docker))

(use-package docker-tramp)

(use-package dockerfile-mode
  :general
  (my--local-leader-def :keymaps 'dockerfile-mode-map
    "b" 'dockerfile-build-buffer
    "B" 'dockerfile-build-no-cache-buffer))

(use-package docker-compose-mode
  :general
  (my--local-leader-def :keymaps 'docker-compose-mode-map
    "." 'docker-compose))
#+end_src

** Ansible
#+begin_src emacs-lisp
(use-package ansible-doc
  :general
  (my--local-leader-def :keymaps 'yaml-mode-map
    "h" '(ansible-doc :wh "doc"))
  :hook
  (yaml-mode-hook . ansible-doc-mode)
  :config
  (evil-set-initial-state 'ansible-doc-module-mode 'motion))

(use-package jinja2-mode
  :mode "\\.j2\\'")

(use-package company-ansible
  :after company yaml-mode
  :init
  (add-to-list 'company-backends 'company-ansible))

(use-package ansible-vault-with-editor
  :ensure nil
  :quelpa
  (ansible-vault-with-editor
   :fetcher github
   :repo "rynffoll/ansible-vault-with-editor")
  :general
  (my--local-leader-def :keymaps 'yaml-mode-map
    "e" '(ansible-vault-with-editor-edit :wk "edit")
    "E" '(ansible-vault-with-editor-encrypt :wk "encrypt")
    "D" '(ansible-vault-with-editor-decrypt :wk "decrypt")))
#+end_src

** HTTP
#+begin_src emacs-lisp
(use-package restclient
  :mode
  ("\\.http\\'" . restclient-mode))

(use-package company-restclient
  :after company restclient
  :init
  (add-to-list 'company-backends 'company-restclient))

(use-package ob-restclient
  :after org restclient)

(use-package restclient-test
  :hook
  (restclient-mode-hook . restclient-test-mode))
#+end_src

** SSH
#+begin_src emacs-lisp
(use-package ssh-config-mode
  :init
  (autoload 'ssh-config-mode "ssh-config-mode" t))
#+end_src

* Utils
#+begin_src emacs-lisp
(use-package password-generator
  :general
  (my--leader-def
    "ip" '(:ignore t :wk "password-generator")
    "ips" 'password-generator-simple
    "ipS" 'password-generator-strong
    "ipp" 'password-generator-paranoid
    "ipn" 'password-generator-numeric
    "ipP" 'password-generator-phonetic))

(use-package google-translate
  :general
  (my--leader-def
    "ht" 'google-translate-at-point
    "hT" 'google-translate-at-point-reverse)
  :custom
  (google-translate-default-target-language "ru")
  (google-translate-default-source-language "en")
  (google-translate-pop-up-buffer-set-focus t)
  (google-translate-backend-method 'curl))

(use-package olivetti
  :general
  (my--leader-def
    "to" 'olivetti-mode)
  :custom
  (olivetti-body-width 100))

(use-package crux
  :general
  (my--leader-def
    "fR" 'crux-rename-file-and-buffer
    "fD" 'crux-delete-file-and-buffer))

(use-package deadgrep
  :general
  (my--leader-def
    "/D" 'deadgrep))

(use-package try
  :general
  (my--leader-def
    "Pt" 'try))

(use-package string-inflection)
#+end_src

* The end
Disable debugging
#+begin_src emacs-lisp
(setq debug-on-error nil)
(setq debug-on-quit nil)
#+end_src

#+begin_src emacs-lisp :tangle no
;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) nil t)
;; End:
#+end_src

