init.el

(use-package magit
  :defer t
  :commands magit-blame
  :general
  (my--leader-def
    "g." 'magit-dispatch
    "gI" 'magit-init
    "gb" 'magit-blame
    "gc" 'magit-clone
    "gg" 'magit-status
    "gl" 'magit-log-buffer-file)
  :custom
  (magit-completing-read-function 'ivy-completing-read)
  (magit-clone-default-directory "~/Projects")
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  (magit-repository-directories `((,user-emacs-directory . 0)
                                  (,magit-clone-default-directory . 1))))

(use-package magit-todos
  :defer t
  :custom
  (magit-todos-keyword-suffix (rx (optional "(" (1+ (not (any ")"))) ")" ":")))
  :hook
  (magit-mode-hook . magit-todos-mode))

(use-package git-timemachine
  :defer t
  :general
  (my--leader-def
    "gt" 'git-timemachine))

(use-package gitignore-templates
  :defer t
  :general
  (my--leader-def
    "gi" 'gitignore-templates-new-file)
  (my--local-leader-def :keymaps 'gitignore-mode-map
    "i" 'gitignore-templates-insert))

(use-package gitattributes-mode :defer t)
(use-package gitconfig-mode :defer t)
(use-package gitignore-mode :defer t)

(use-package diff-hl
  :defer t
  :custom
  (diff-hl-draw-borders nil)
  :hook
  (after-init-hook . global-diff-hl-mode)
  (diff-hl-mode-hook . diff-hl-flydiff-mode)
  (dired-mode-hook . diff-hl-dired-mode)
  (magit-post-refresh-hook . diff-hl-magit-post-refresh))

(use-package org
  :ensure org-plus-contrib
  :defer t
  :preface
  (defun my--open-org-directory () (interactive) (find-file org-directory))
  (defun my--open-org-inbox-file () (interactive) (find-file my--org-inbox-file))
  (defun my--open-org-todo-file () (interactive) (find-file my--org-todo-file))
  (defun my--open-org-notes-file () (interactive) (find-file my--org-notes-file))
  :general
  (my--leader-def
    "Oa" '(org-agenda :wk "agenda")
    "O." '(my--open-org-directory :wk "open org-directory")
    "Oi" '(my--open-org-inbox-file :wk "open inbox")
    "Ot" '(my--open-org-todo-file :wk "open todo")
    "On" '(my--open-org-notes-file :wk "open notes"))
  :custom-face
  (org-block-begin-line ((t :background "grey90")))
  (org-block ((t :background "grey95")))
  (org-tag ((t :inherit shadow)))
  (org-ellipsis ((t :underline nil)))
  :custom
  (org-insert-heading-respect-content t "Insert new headings after current subtree rather than inside it")

  (org-startup-indented t)
  (org-tags-column 0)
  ;; (org-ellipsis "  ")
  (org-ellipsis "…")
  (org-pretty-entities t)
  (org-use-sub-superscripts '{} "Require {} for sub/super scripts")
  (org-return-follows-link t)

  (org-list-allow-alphabetical t)
  (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+")))

  (org-startup-with-inline-images t)

  (org-src-fontify-natively t)
  (org-src-tab-acts-natively t)
  (org-src-window-setup 'current-window)
  (org-edit-src-content-indentation 0)
  (org-catch-invisible-edits 'smart)

  (org-hide-leading-stars t)
  (org-hide-leading-stars-before-indent-mode t)

  (org-fontify-done-headline nil)
  (org-fontify-quote-and-verse-blocks t)
  (org-fontify-whole-heading-line t)

  (org-todo-keywords '((sequence "TODO(t)" "WAIT(w@/!)" "|" "DONE(d!/@)" "CANCELED(c@/!)")))
  (org-priority-faces '((?A . (:inherit error :weight bold))
                        (?B . (:inherit warning :weight bold))
                        (?C . (:inherit success :weight bold))))
  (org-log-into-drawer t)

  (org-directory "~/Org")
  (my--org-inbox-file (concat org-directory "/inbox.org"))
  (my--org-todo-file (concat org-directory "/todo.org"))
  (my--org-notes-file (concat org-directory "/notes.org"))
  (org-agenda-files `(,my--org-inbox-file ,my--org-todo-file))
  (org-archive-location (concat org-directory "/old/archive.org" "::* From %s")))

(use-package org-bullets
  :defer t
  :after org
  :custom
  ;; ♥ ● ◇ ✚ ✜ ☯ ◆ ♠ ♣ ♦ ☢ ❀ ◆ ◖ ▶
  ;; ► • ★ ▸
  (org-bullets-bullet-list '("○"))
  :hook
  (org-mode-hook . org-bullets-mode))

(use-package toc-org
  :defer t
  :hook
  (org-mode-hook . toc-org-enable))

(use-package ob-core
  :ensure org-plus-contrib
  :defer t
  :hook
  (org-babel-after-execute-hook . org-redisplay-inline-images)
  :config
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (restclient . t)
     (plantuml . t))))

(use-package ob-async
  :after org)

(use-package docker
  :defer t
  :general
  (my--leader-def
    "od" 'docker))

(use-package docker-tramp
  :defer t)

(use-package dockerfile-mode
  :defer t
  :general
  (my--local-leader-def :keymaps 'dockerfile-mode-map
    "b" 'dockerfile-build-buffer
    "B" 'dockerfile-build-no-cache-buffer))

(use-package docker-compose-mode
  :defer t
  :general
  (my--local-leader-def :keymaps 'docker-compose-mode-map
    "." 'docker-compose))

(use-package ansible-doc
  :defer t
  :general
  (my--local-leader-def :keymaps 'yaml-mode-map
    "h" '(ansible-doc :wh "doc"))
  :hook
  (yaml-mode-hook . ansible-doc-mode)
  :config
  (evil-set-initial-state 'ansible-doc-module-mode 'motion))

(use-package jinja2-mode
  :defer t
  :mode "\\.j2\\'")

(use-package company-ansible
  :defer t
  :after company yaml-mode
  :init
  (add-to-list 'company-backends 'company-ansible))

(use-package ansible-vault-with-editor
  :ensure nil
  :quelpa
  (ansible-vault-with-editor
   :fetcher github
   :repo "rynffoll/ansible-vault-with-editor")
  :defer t
  :general
  (my--local-leader-def :keymaps 'yaml-mode-map
    "e" '(ansible-vault-with-editor-edit :wk "edit")
    "E" '(ansible-vault-with-editor-encrypt :wk "encrypt")
    "D" '(ansible-vault-with-editor-decrypt :wk "decrypt")))

(use-package restclient
  :defer t
  :mode
  ("\\.http\\'" . restclient-mode))

(use-package company-restclient
  :defer t
  :after company restclient
  :init
  (add-to-list 'company-backends 'company-restclient))

(use-package ob-restclient
  :after org restclient)

(use-package restclient-test
  :defer t
  :hook
  (restclient-mode-hook . restclient-test-mode))

(use-package ssh-config-mode
  :defer t
  :init
  (autoload 'ssh-config-mode "ssh-config-mode" t))

(use-package password-generator
  :defer t
  :general
  (my--leader-def
    "ip" '(:ignore t :wk "password-generator")
    "ips" 'password-generator-simple
    "ipS" 'password-generator-strong
    "ipp" 'password-generator-paranoid
    "ipn" 'password-generator-numeric
    "ipP" 'password-generator-phonetic))

(use-package google-translate
  :defer t
  :general
  (my--leader-def
    "ht" 'google-translate-at-point
    "hT" 'google-translate-at-point-reverse)
  :custom
  (google-translate-default-target-language "ru")
  (google-translate-default-source-language "en")
  (google-translate-pop-up-buffer-set-focus t)
  (google-translate-backend-method 'curl))

(use-package olivetti
  :defer t
  :general
  (my--leader-def
    "to" 'olivetti-mode)
  :custom
  (olivetti-body-width 100))

(use-package crux
  :defer t
  :general
  (my--leader-def
    "fR" 'crux-rename-file-and-buffer
    "fD" 'crux-delete-file-and-buffer))

(use-package deadgrep
  :defer t
  :general
  (my--leader-def
    "/D" 'deadgrep))

(use-package try
  :defer t
  :general
  (my--leader-def
    "Pt" 'try))

(use-package string-inflection
  :defer t)

(setq debug-on-error nil)
(setq debug-on-quit nil)
